using System.Diagnostics;
using Microsoft.AspNetCore.Mvc;
using Practice1.Models;

namespace Practice1.Controllers;

[Route("[controller]")]
public class HomeController : Controller
{
    [HttpGet("Contact")]
    public IActionResult ContactInfo()
    {
        ViewBag.Email = "info@angkoruniversity.edu.kh";
        ViewBag.Phone = "063 760 123";
        ViewBag.Telegram = "@angkor_tech";
        return View();
        /*
            1. ចូរសរសេរ Controller Action មួយឈ្មោះ ContactInfo() 
            ដើម្បីបញ្ជូនព័ត៌មានទំនាក់ទំនងរបស់សាកលវិទ្យាល័យរួមមាន 
            Email, Phone, Telegram ទៅកាន់ View តាមរយៈ ViewBag 
            រួចបង្ហាញព័ត៌មានទាំងនោះក្នុងទម្រង់ HTML card ស្អាត។
        */
    }

    [HttpGet("Check")]
    public IActionResult CheckGrade(double score = 75.5) {
        ViewBag.Score = score;
        return View();
        /*
            ចូរសរសេរ Controller Action មួយដែលទទួលបានពិន្ទុ (double score) 
            រួចបញ្ជូនពិន្ទុទៅកាន់ View។ នៅក្នុង View ត្រូវប្រើប្រាស់ Razor @if-else 
            ដើម្បីពិនិត្យលក្ខខណ្ឌ៖ ប្រសិនបើពិន្ទុចាប់ពី ៥០ ឡើងទៅ ត្រូវបង្ហាញសារពណ៌បៃតង 
            "អ្នកបានប្រឡងជាប់" បើផ្ទុយទៅវិញ បង្ហាញសារពណ៌ក្រហម "អ្នកបានប្រឡងធ្លាក់"។
        */
    }

    [HttpGet("List")]
    public IActionResult ServiceList() {
        List<string> services = new() { "Web Design", "Mobile App", "Cloud Hosting" };
        ViewBag.Services = services;
        return View();
        /*
            ចូរបង្កើតបញ្ជីរាយនាមសេវាកម្ម (List of strings) នៅក្នុង Action 
            រួចផ្ញើតាមរយៈ ViewBag ទៅកាន់ View។ សរសេររង្វិលជុំ @foreach នៅក្នុងឯកសារ 
            CSHTML ដើម្បីបង្ហាញបញ្ជីសេវាកម្មនោះក្នុងតារាង HTML (Table) ដែលមានបង្ហាញលេខរៀង
            លំដាប់លំដោយច្បាស់លាស់។
        */
    }

    
}
